#pragma once

#ifndef _GLOBALS_H
#define _GLOBALS_H

#define TAG_PRO              'mema'

typedef struct tagPOINT
{
    LONG  x;
    LONG  y;
} POINT, * PPOINT;

typedef struct tagTHREADINFO
{
    /* 0x0000 */ struct _ETHREAD* pEThread;
}THREADINFO, * PTHREADINFO;

typedef struct _THRDESKHEAD
{
    /* 0x0000 */ void* h;
    /* 0x0008 */ unsigned long cLockObj;
    /* 0x000c */ long Padding_21;
    /* 0x0010 */ struct tagTHREADINFO* pti;
    /* 0x0018 */ struct tagDESKTOP* rpdesk;
    /* 0x0020 */ unsigned char* pSelf;
} THRDESKHEAD, * PTHRDESKHEAD; /* size: 0x0028 */

typedef struct tagWND
{
    struct _THRDESKHEAD head;
}WND, * PWND;

typedef enum _SYSTEM_DLL_TYPE
{
    PsNativeSystemDll = 0,
    PsWowX86SystemDll = 1,
    PsWowArm32SystemDll = 2,
    PsWowChpeX86SystemDll = 3,
    PsChpeV2SystemDll = 4,
    PsVsmEnclaveRuntimeDll = 5,
    PsTrustedAppsRuntimeDll = 6,
    PsSystemDllTotalTypes = 7,
} SYSTEM_DLL_TYPE, * PSYSTEM_DLL_TYPE;

typedef enum _WINDOWINFOCLASS
{
    WindowProcess = 0,
    WindowRealProcess = 1,
    WindowThread = 2,
    WindowActiveWindow = 3,
    WindowFocusWindow = 4,
    WindowIsHung = 5,
    WindowClientBase = 6,
    WindowIsForegroundThread = 7,
    WindowDefaultImeWindow = 8,
    WindowDefaultInputContext = 9,
} WINDOWINFOCLASS, * PWINDOWINFOCLASS;

union PROCESSFLAGS {
    /* 0x0464 */ unsigned long Flags;
    struct /* bitfield */
    {
        /* 0x0464 */ unsigned long CreateReported : 1; /* bit position: 0 */
        /* 0x0464 */ unsigned long NoDebugInherit : 1; /* bit position: 1 */
        /* 0x0464 */ unsigned long ProcessExiting : 1; /* bit position: 2 */
        /* 0x0464 */ unsigned long ProcessDelete : 1; /* bit position: 3 */
        /* 0x0464 */ unsigned long ManageExecutableMemoryWrites : 1; /* bit position: 4 */
        /* 0x0464 */ unsigned long VmDeleted : 1; /* bit position: 5 */
        /* 0x0464 */ unsigned long OutswapEnabled : 1; /* bit position: 6 */
        /* 0x0464 */ unsigned long Outswapped : 1; /* bit position: 7 */
        /* 0x0464 */ unsigned long FailFastOnCommitFail : 1; /* bit position: 8 */
        /* 0x0464 */ unsigned long Wow64VaSpace4Gb : 1; /* bit position: 9 */
        /* 0x0464 */ unsigned long AddressSpaceInitialized : 2; /* bit position: 10 */
        /* 0x0464 */ unsigned long SetTimerResolution : 1; /* bit position: 12 */
        /* 0x0464 */ unsigned long BreakOnTermination : 1; /* bit position: 13 */
        /* 0x0464 */ unsigned long DeprioritizeViews : 1; /* bit position: 14 */
        /* 0x0464 */ unsigned long WriteWatch : 1; /* bit position: 15 */
        /* 0x0464 */ unsigned long ProcessInSession : 1; /* bit position: 16 */
        /* 0x0464 */ unsigned long OverrideAddressSpace : 1; /* bit position: 17 */
        /* 0x0464 */ unsigned long HasAddressSpace : 1; /* bit position: 18 */
        /* 0x0464 */ unsigned long LaunchPrefetched : 1; /* bit position: 19 */
        /* 0x0464 */ unsigned long Background : 1; /* bit position: 20 */
        /* 0x0464 */ unsigned long VmTopDown : 1; /* bit position: 21 */
        /* 0x0464 */ unsigned long ImageNotifyDone : 1; /* bit position: 22 */
        /* 0x0464 */ unsigned long PdeUpdateNeeded : 1; /* bit position: 23 */
        /* 0x0464 */ unsigned long VdmAllowed : 1; /* bit position: 24 */
        /* 0x0464 */ unsigned long ProcessRundown : 1; /* bit position: 25 */
        /* 0x0464 */ unsigned long ProcessInserted : 1; /* bit position: 26 */
        /* 0x0464 */ unsigned long DefaultIoPriority : 3; /* bit position: 27 */
        /* 0x0464 */ unsigned long ProcessSelfDelete : 1; /* bit position: 30 */
        /* 0x0464 */ unsigned long SetTimerResolutionLink : 1; /* bit position: 31 */
    }; /* bitfield */
}; /* size: 0x0004 */

union CROSSTHREADFLAGS {
    /* 0x0560 */ unsigned long All;
    struct /* bitfield */
    {
        /* 0x0560 */ unsigned long Terminated : 1; /* bit position: 0 */
        /* 0x0560 */ unsigned long ThreadInserted : 1; /* bit position: 1 */
        /* 0x0560 */ unsigned long HideFromDebugger : 1; /* bit position: 2 */
        /* 0x0560 */ unsigned long ActiveImpersonationInfo : 1; /* bit position: 3 */
        /* 0x0560 */ unsigned long HardErrorsAreDisabled : 1; /* bit position: 4 */
        /* 0x0560 */ unsigned long BreakOnTermination : 1; /* bit position: 5 */
        /* 0x0560 */ unsigned long SkipCreationMsg : 1; /* bit position: 6 */
        /* 0x0560 */ unsigned long SkipTerminationMsg : 1; /* bit position: 7 */
        /* 0x0560 */ unsigned long CopyTokenOnOpen : 1; /* bit position: 8 */
        /* 0x0560 */ unsigned long ThreadIoPriority : 3; /* bit position: 9 */
        /* 0x0560 */ unsigned long ThreadPagePriority : 3; /* bit position: 12 */
        /* 0x0560 */ unsigned long RundownFail : 1; /* bit position: 15 */
        /* 0x0560 */ unsigned long UmsForceQueueTermination : 1; /* bit position: 16 */
        /* 0x0560 */ unsigned long IndirectCpuSets : 1; /* bit position: 17 */
        /* 0x0560 */ unsigned long DisableDynamicCodeOptOut : 1; /* bit position: 18 */
        /* 0x0560 */ unsigned long ExplicitCaseSensitivity : 1; /* bit position: 19 */
        /* 0x0560 */ unsigned long PicoNotifyExit : 1; /* bit position: 20 */
        /* 0x0560 */ unsigned long DbgWerUserReportActive : 1; /* bit position: 21 */
        /* 0x0560 */ unsigned long ForcedSelfTrimActive : 1; /* bit position: 22 */
        /* 0x0560 */ unsigned long SamplingCoverage : 1; /* bit position: 23 */
        /* 0x0560 */ unsigned long ReservedCrossThreadFlags : 8; /* bit position: 24 */
    }; /* bitfield */
}; /* size: 0x0004 */

//Vol3B[18.2 DEBUG REGISTERS]
union Dr6 {
    uint64_t flags;
    struct
    {
        uint64_t B0 : 1; //bit0
        uint64_t B1 : 1; //bit1
        uint64_t B2 : 1; //bit2
        uint64_t B3 : 1; //bit3
        uint64_t Reserved_1 : 7; //bit10:4
        uint64_t BLD : 1; //bit11
        uint64_t Reserved_2 : 1; //bit12
        uint64_t BD : 1; //bit13
        uint64_t BS : 1; //bit14 (single step)
        uint64_t BT : 1; //bit15
        uint64_t RTM : 1; //bit16
    };
};

union EFLAGS
{
    uint32_t flags;
    struct
    {
        uint32_t CF : 1; //bit0
        uint32_t Reserved_1 : 1; //bit1
        uint32_t PF : 1; //bit2
        uint32_t Reserved_2 : 1; //bit3
        uint32_t AF : 1; //bit4
        uint32_t Reserved_3 : 1; //bit5
        uint32_t ZF : 1; //bit6
        uint32_t SF : 1; //bit7
        uint32_t TF : 1; //bit8
        uint32_t IF : 1; //bit9
        uint32_t DF : 1; //bit10
        uint32_t OF : 1; //bit11
        uint32_t IOPL : 2; //bit13:12
        uint32_t NT : 1; //bit14
        uint32_t Reserved_4 : 1; //bit15
        uint32_t RF : 1; //bit16
        uint32_t VM : 1; //bit17
        uint32_t AC : 1; //bit18
        uint32_t VIF : 1; //bit19
        uint32_t VIP : 1; //bit20
        uint32_t ID : 1; //bit21
    };
};

typedef enum _DEBUGOBJECTINFOCLASS {
    DebugObjectFlags = 1,
    MaxDebugObjectInfoClass
} DEBUGOBJECTINFOCLASS, * PDEBUGOBJECTINFOCLASS;

typedef struct _DBGKP_ERROR_PORT
{
    ULONG RefCount;
    ULONG Flags;
    HANDLE PortHandle;
} DBGKP_ERROR_PORT, * PDBGKP_ERROR_PORT; /* size: 0x0010 */

#pragma pack(push, 8)
typedef struct _Debugport_Struct
{
    unsigned __int64 id;
    size_t DebugPort;
}Debugport_Struct, * PDebugport_Struct;
#pragma pack(pop)

typedef enum _PSW32THREADCALLOUTTYPE {
    PsW32ThreadCalloutInitialize,
    PsW32ThreadCalloutExit
} PSW32THREADCALLOUTTYPE;

typedef enum _SHUTDOWN_ACTION
{
    ShutdownNoReboot,
    ShutdownReboot,
    ShutdownPowerOff
} SHUTDOWN_ACTION, * PSHUTDOWN_ACTION;

typedef struct _FILEDATA
{
    LIST_ENTRY list_entry;
    UNICODE_STRING fileName;
    UNICODE_STRING filePath;
}FILEDATA, * PFILEDATA;

typedef struct _WINDOW_DATA
{
    LIST_ENTRY list_entry;
    UNICODE_STRING WindowName;
}WINDOW_DATA, * PWINDOW_DATA;

typedef struct _PROTECTOBJ
{
    MY_LIST list_entry;    //保护对象列表
    FAST_MUTEX Mutex;          //互斥锁
}PROTECTOBJ, * PPROTECTOBJ;

typedef struct _DEBUGGER_TABLE
{
    MY_LIST list_entry;        //指向DEBUGGER_DATA对象
    FAST_MUTEX Mutex;          //互斥锁
}DEBUGGER_TABLE, * PDEBUGGER_TABLE;

//
// Debug Object
//
typedef struct _DEBUG_OBJECT
{
    KEVENT EventsPresent;        //在事件列表被填充时设置的事件。
    FAST_MUTEX Mutex;            //互斥锁
    LIST_ENTRY EventList;        //调试事件的队列
    ULONG Flags;
} DEBUG_OBJECT, * PDEBUG_OBJECT;

typedef struct _MINI_CONTEXT_WOW64
{
    BOOLEAN initializated;  //用户判断shadow context是否已经初始化
    /* 0x0004 */ unsigned long Dr0;
    /* 0x0008 */ unsigned long Dr1;
    /* 0x000c */ unsigned long Dr2;
    /* 0x0010 */ unsigned long Dr3;
    /* 0x0014 */ unsigned long Dr6;
    /* 0x0018 */ unsigned long Dr7;
    /* 0x00c0 */ unsigned long EFlags;
}MINI_CONTEXT_WOW64, * PMINI_CONTEXT_WOW64;

typedef struct _MINI_CONTEXT
{
    BOOLEAN initializated;  //用户判断shadow context是否已经初始化
    ULONG64 Dr0;
    ULONG64 Dr1;
    ULONG64 Dr2;
    ULONG64 Dr3;
    ULONG64 Dr6;
    ULONG64 Dr7;
    ULONG EFlags;
}MINI_CONTEXT, * PMINI_CONTEXT;

//调试进程对象
typedef struct _DEBUG_PROCESS
{
    LIST_ENTRY list_entry;
    FAST_MUTEX Mutex;          //互斥锁
    _EPROCESS* Process;  //进程对象
    PDEBUG_OBJECT DebugObject;  //调试对象
    MINI_CONTEXT Context;
    MINI_CONTEXT_WOW64 wow64Context;
}DEBUG_PROCESS, * PDEBUG_PROCESS;

typedef struct _DEBUG_PROCESS_TABLE
{
    MY_LIST list_entry;    //指向DEBUG_PROCESS对象
    FAST_MUTEX Mutex;          //互斥锁
}DEBUG_PROCESS_TABLE, * PDEBUG_PROCESS_TABLE;


typedef struct _BREAKPOINT_TABLE_ENTRY
{
    LIST_ENTRY list_entry;
    _EPROCESS* Process;  //进程对象
    PVOID BreakpointAddress;  //断点地址
    //BYTE firstByte;  //首字节内容
    //BYTE originalByte  //原始字节内容
